//==================================================================
//												Animation2DSystem.cpp
//	2Dアニメーション管理システム
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/12/23	アニメーション2Dシステム作成
//
//===================================================================


//===== インクルード部 =====
#include "Animation2DSystem.h"
#include "../ECSCompoent/Animator2D.h"
#include <algorithm>

using namespace ECS;


//===== マクロ定義 =====


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====



//===================================
//
//	コンストラクタ
//
//===================================
Animation2DSystem::Animation2DSystem(World* pWorld)
	: System<Animator2D>(pWorld)
{
	// 更新順
	SetUpdateOrder(UpdateOrder::eAnimation2D);
}


//===================================
//
//	デストラクタ
//
//===================================
Animation2DSystem::~Animation2DSystem()
{
}


//===================================
//
//	生成時コールバック
//
//===================================
void Animation2DSystem::OnCreate()
{
}

//===================================
//
//	更新時コールバック
//
//===================================
void Animation2DSystem::OnUpdate()
{
	std::for_each(m_ComponentList.begin(), m_ComponentList.end(),
		[](Animator2D* anim)
		{
			anim->AnimationUpdate();
		});
}

//===================================
//
//	削除時コールバック
//
//===================================
void Animation2DSystem::OnDestroy()
{
}
