//==================================================================
//												ScriptSystem.h
//	スクリプト管理システム
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/12/27	スクリプトシステム作成
//
//===================================================================


//===== インクルード部 =====
#include "ScriptSystem.h"
#include "../ECSCompoent/Script.h"
#include <algorithm>

using namespace ECS;


//===== マクロ定義 =====


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====



//===================================
//
//	コンストラクタ
//
//===================================
ScriptSystem::ScriptSystem(World* pWorld)
	: System<Script>(pWorld)
{
	// 更新順
	SetUpdateOrder(UpdateOrder::eScript);
}


//===================================
//
//	デストラクタ
//
//===================================
ScriptSystem::~ScriptSystem()
{
}


//===================================
//
//	生成時コールバック
//
//===================================
void ScriptSystem::OnCreate()
{
}

//===================================
//
//	更新時コールバック
//
//===================================
void ScriptSystem::OnUpdate()
{
	std::for_each(m_ComponentList.begin(), m_ComponentList.end(),
		[](Script* script)
		{
			script->Update();
		});
}

//===================================
//
//	後更新時コールバック
//
//===================================
void ScriptSystem::OnLateUpdate()
{
	std::for_each(m_ComponentList.begin(), m_ComponentList.end(),
		[](Script* script)
		{
			script->LateUpdate();
		});
}

//===================================
//
//	削除時コールバック
//
//===================================
void ScriptSystem::OnDestroy()
{
}
