//==================================================================
//												MasterWorld.h
//	マスターワールド
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2021/01/11	マスターワールドクラス作成
//
//===================================================================

#pragma once

//====== インクルード部 ======
#include "../ECS/World/World.h"


//===== マクロ定義 =====


//===== クラス定義 =====
namespace ECS
{
	// マスターワールドクラス
	class MasterWorld : public World
	{
	public:
		// コンストラクタ
		MasterWorld(std::string name);
		// デストラクタ
		virtual ~MasterWorld();

		// ワールドの初期化
		virtual void Start();
		// ワールドの終了
		virtual void End();
	};
}
