//==================================================================
//												MasterWorld.cpp
//	マスターワールド
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2021/01/11	マスターワールドクラス作成
//
//===================================================================


//===== インクルード部 =====
#include "MasterWorld.h"
#include "../ECS/Entity/EntityManager.h"
#include "../ECS/System/ISystem.h"
#include <algorithm>

using namespace ECS;


//===== マクロ定義 =====


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	コンストラクタ
//
//===================================
MasterWorld::MasterWorld(std::string name)
	:World(name)
{
}

//===================================
//
//	デストラクタ
//
//===================================
MasterWorld::~MasterWorld()
{
}

//===================================
//
//	ワールドの初期化
//
//===================================
void MasterWorld::Start()
{
}

//===================================
//
//	ワールドの終了
//
//===================================
void MasterWorld::End()
{
}
