//==================================================================
//												GameObject.cpp
//	ワールドで存在できるもの　ゲームオブジェクト
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/12/27	ゲームオブジェクトクラス作成
//
//===================================================================


//===== インクルード部 =====
#include "GameObject.h"
#include "../ECSCompoent/Transform.h"


using namespace ECS;


//===== マクロ定義 =====


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	コンストラクタ
//
//===================================
GameObject::GameObject(EntityManager* entityManager)
	: IEntity(entityManager),
	m_bActive(true)
{
}

//===================================
//
//	デストラクタ
//
//===================================
GameObject::~GameObject()
{
}

//===================================
//
//	生成時コールバック
//
//===================================
void GameObject::OnCreate()
{
	// 自身のスマートポインタ
	m_gameObject = std::static_pointer_cast<GameObject>(m_self.lock());

	// トランスフォーム作成
	m_transform = AddComponent<Transform>();
	// ゲームオブジェクトをセット
	m_transform.lock()->SetGameObject(m_gameObject);

	// スタート関数
	this->Start();
}

//===================================
//
//	破棄時コールバック
//
//===================================
void GameObject::OnDestroy()
{
	// エンド関数
	this->End();
}

