//==================================================================
//												IEntity.cpp
//	エンティティベース
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/12/21	ベースのエンティティクラス作成
//
//===================================================================


//===== インクルード部 =====
#include "IEntity.h"
#include "EntityManager.h"
#include <algorithm>

using namespace ECS;


//===== マクロ定義 =====


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	コンストラクタ
//
//===================================
IEntity::IEntity()
{
}


//===================================
//
//	デストラクタ
//
//===================================
IEntity::~IEntity()
{
}

//===================================
//
//	自身の破棄
//
//===================================
void IEntity::Destroy()
{
	//IEntityManager::GetInstance()->DestroyIEntity(this);
	Object::Destroy();
}

//===================================
//
//	コンポーネントにメッセージ送信
//
//===================================
void IEntity::SendComponentMessage(std::string message)
{
	// メッセージ処理
	std::for_each(m_ComponentPool.begin(), m_ComponentPool.end(),
		[message](const auto& com)
		{
			com->SendMessage(message);
		});

	//for (const auto& com : m_ComponentPool)
	//{
	//	com->SendMessage(message);
	//}
}
