////==================================================================
////								SkyDomeRenderer.h
////	スカイドームレンダラー
////
////==================================================================
////	author :	AT12A 05 宇佐美晃之
////==================================================================
////	開発履歴
////
////	2021/01/15 スカイドームレンダラークラス作成
////
////===================================================================
//
//#pragma once
//
////====== インクルード部 ======
//#include "MeshRenderer.h"
//
//
////===== マクロ定義 =====
//
//
////===== クラス定義 =====
//
//namespace ECS
//{
//	class SkyDomeRenderer : public MeshRenderer
//	{
//	public:
//		// コンストラクタ
//		SkyDomeRenderer();
//		// デストラクタ
//		~SkyDomeRenderer();
//
//		// カメラからの距離を格納
//		virtual void LayerUpdate() {}
//
//	private:
//
//	};
//}
