//==================================================================
//												uniqueTypeID.h
//	型に一意の数値を割り当てるクラス
//	コンポーネントのIDとして使用
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/09/23	ユニークタイプIDクラスの作品
//
//===================================================================

#pragma once

//====== インクルード部 ======


//===== マクロ定義 =====


//===== クラス定義 =====
class CUniqueTypeID
{
public:

	// テンプレートの型ごとに違う値を返す
	template <class T>
	static int Get()
	{
		static int nInternalID = m_nTypeID++;
		return nInternalID;
	}

private:
	static int m_nTypeID;
};

